echo on
#read_liberty ./techmap.lib
read_verilog ./test-tri.v
hierarchy -check -top DemoSimpleTri__GAL16V8_DIP__registered
tribuf
proc
splitnets
synth
abc -g AND,OR
show -viewer none -format svg -prefix ./build/test-tri_show
write_json ./build/test-tri.json
