echo on
#read_liberty ./techmap.lib
read_verilog ./test-cnt.v
hierarchy -check -check -top DemoSimpleSync__GAL16V8_DIP__registered
tribuf
proc
splitnets
synth
abc -g AND,OR
show -viewer none -format svg -prefix ./build/test-cnt_show
write_json ./build/test-cnt.json
